clear all

Fs = 8000; % частота квантования
f1 = 400; % частота заполнения одного из импульсов
f2 = 1200; % частота заполнения другого импульса
tau = 0.02; % длительность импульсов
t1 = 0.02; % время прихода первого импульса
t2 = 0.06; % время прихода второго импульса
dt = 1/Fs; % период квантования
t = 0:dt:0.1; % время
N = length(t); % количество отсчётов
% создаём сигналы, состоящие из двух импульсов
% сигналы отличаются тем, что импульсы с разной частотой
% приходят в разном порядке
x1 = (t>=t1 & t<t1+tau).*sin(2*pi*f1*t)+ ...
 (t>=t2 & t<t2+tau).*sin(2*pi*f2*t);
x2 = (t>=t1 & t<t1+tau).*sin(2*pi*f2*t)+ ...
 (t>=t2 & t<t2+tau).*sin(2*pi*f1*t);

% сторим графики сигналов
figure
subplot(2,1,1), plot(t,x1,'k'), xlabel('t'), ylabel('x_1(t)')
subplot(2,1,2), plot(t,x2,'k'), xlabel('t'), ylabel('x_2(t)') 

[t,f,Fsig] = WinFFT(x1,triang(128), 64, Fs);
SpectrVisWF(Fsig,t,f)